Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServerProxy.ToggleCmd(System.Boolean)
click auto finish button
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServerProxy.IsChecked(System.Boolean)
check auto finish button state
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServerProxy.IsEnabled(Autodesk.Revit.DB.WallType,System.Boolean)
check auto finish button state
Since:
2025

Autodesk.Revit.DB.Architecture.IWallPlacementPostProcessingServerProxy.Process(Autodesk.Revit.DB.Architecture.WallPlacementPostProcessingServiceData)
do some thing after wall placement
Since:
2025